package homeworks.homework_1;

/**
 * Реализовать класс Товар, содержащий следующие свойства:
 * 1. Название
 * 2. Цена
 * 3. Количество
 * 4. Единица измерения
 * А так же реализовать следующие классы-наследники:
 * 1. Продукты питания, содержащие следующие свойства:
 * 1.1 Срок годности
 * 2. Напитки, содержащие следующие свойства:
 * 2.1 Объём
 * 3. Предметы гигиены, содержащие следующие свойства:
 * 3.1 Количество штук в упаковке
 * 4. Детские товары:
 * 4.1 Минимальный возраст
 * 4.2 Гипоаллергенность,
 * А так же реализовать слеюущие классы, наследуемые от приведённых выше
 * классов:
 * 5. Молоко, содержащиее следующее свойство:
 * 5.1 Процент жирности
 * 5.2 Срок годности
 * 6. Лимонад
 * 7. Хлеб, содержащий следующие свойство:
 * 7.1 Тип муки
 * 8. Яйца, содержащее следующиее свойство:
 * 8.1 Количество в упаковке
 * 9. Маски
 * 10. Туалетная бумага, содержащее следующее свойство:
 * 10.1 Количество слоёв
 * 11. Подгузники, содержащие следующее свойства:
 * 11.1 Размер
 * 11.2 Минимальный вес
 * 11.3 Максимальный вес
 * 11.4 Тип
 * 12. Соска
 * У всех классов перегрузить метод ToString класса Object,
 * от которого наследуются все классы, в котором будет происходить вывод
 * всей информации о товаре, так же реализовать конструкторы, принимающие все
 * поля.
 * Реализовать в классе Program, метод выводящий все данные о товаре.
 * Создать в Main все объекты товаров и проверить работу метода, созданного в
 * классе Program
 */

public class programProduct {
  public static void main(String[] args) {
    // создание экземпляра класса Products и вывод информации об этом объекте
    Products product_1 = new Products("Конфеты", 100, 300, "кг");
    System.out.println(product_1.toString());

    // создание экземпляра класса Food и вывод информации об этом объекте
    Food food_1 = new Food("Продукты питания", 10, 150, "кг", "10 дней");
    System.out.println(food_1.toString());

    // создание экземпляра класса Milk и вывод информации об этом объекте
    Milk milk_1 = new Milk("Молоко", 10, 15, "литры", "3 дня", 1);
    System.out.println(milk_1.toString());

    // создание экземпляра класса Bread и вывод информации об этом объекте
    Bread bread_1 = new Bread("Хлеб", 20, 30, "кг", "24 часа", "Серая");
    System.out.println(bread_1.toString());

    // создание экземпляра класса Eggs и вывод информации об этом объекте
    Eggs eggs_1 = new Eggs("Яйца", 20, 40, "шт", "15 дней", 20);
    System.out.println(eggs_1.toString());

    // создание экземпляра класса Beverages и вывод информации об этом объекте
    Beverages beverages_1 = new Beverages("Напитки", 25, 30, "литры", 3);
    System.out.println(beverages_1.toString());

    // создание экземпляра класса Lemonade и вывод информации об этом объекте
    Lemonade lemonade_1 = new Lemonade("Лимонад", 230, 100, "литры", 2);
    System.out.println(lemonade_1.toString());

    // создание экземпляра класса HygienceItems и вывод информации об этом объекте
    HygienceItems hygienceItems_1 = new HygienceItems("Предметы гигиены", 200, 30,
        "штук в упаковке", 100);
    System.out.println(hygienceItems_1.toString());

    // создание экземпляра класса Masks и вывод информации об этом объекте
    Masks masks_1 = new Masks("Маски", 100, 200, "штук в упаковке", 100);
    System.out.println(masks_1.toString());

    // создание экземпляра класса ToiletPaper и вывод информации об этом объекте
    ToiletPaper toiletPaper_1 = new ToiletPaper("Туалетная бумага", 100, 100,
        "штук в упаковке", 200, 3);
    System.out.println(toiletPaper_1.toString());

    // создание экземпляра класса ChilgrenProducts и вывод информации об этом
    // объекте
    ChildrenProducts childrenProducts_1 = new ChildrenProducts("Детские товары", 10, 20,
        "штук в упаковке", 1, "Нет");
    System.out.println(childrenProducts_1.toString());

    // создание экземпляра класса Diapers и вывод информации об этом объекте
    Diapers diapers = new Diapers("Подгузники", 200, 100, "штук в упаковке", 
    10, "Нет", 3, 3, 5, "ХХ");
    System.out.println(diapers.toString());

    // создание экземпляра класса Pacifier и вывод информации об этом объекте
    Pacifier pacifier_1 = new Pacifier("Соска", 30, 25, "штук в упаковке", 3, "Нет");
    System.out.println(pacifier_1.toString());
  }
}
